cmsis-svd/cmsis-svd/data/Nuvoton/NUC029EE_v1.svd
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR1</name>
          <displayName>PDMA_CBCR1</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR2</name>
          <displayName>PDMA_CBCR2</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR3</name>
          <displayName>PDMA_CBCR3</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR4</name>
          <displayName>PDMA_CBCR4</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR5</name>
          <displayName>PDMA_CBCR5</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR6</name>
          <displayName>PDMA_CBCR6</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR7</name>
          <displayName>PDMA_CBCR7</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CBCR0">
          <name>PDMA_CBCR8</name>
          <displayName>PDMA_CBCR8</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <alternateRegister>PDMA_CBCR0</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register>
          <name>PDMA_IER0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_IER0</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TABORT_IE</name>
              <description>PDMA Read/Write Target Abort Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Target abort interrupt generation Disabled during PDMA transfer</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Target abort interrupt generation Enabled during PDMA transfer</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKD_IE</name>
              <description>PDMA Block Transfer Done Interrupt Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Interrupt generator Disabled when PDMA transfer is done</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt generator Enabled when PDMA transfer is done</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER1</name>
          <displayName>PDMA_IER1</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER2</name>
          <displayName>PDMA_IER2</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER3</name>
          <displayName>PDMA_IER3</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER4</name>
          <displayName>PDMA_IER4</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER5</name>
          <displayName>PDMA_IER5</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER6</name>
          <displayName>PDMA_IER6</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER7</name>
          <displayName>PDMA_IER7</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_IER0">
          <name>PDMA_IER8</name>
          <displayName>PDMA_IER8</displayName>
          <description>PDMA Channel x Interrupt Enable Register</description>
          <alternateRegister>PDMA_IER0</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register>
          <name>PDMA_ISR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_ISR0</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TABORT_IF</name>
              <description>PDMA Read/Write Target Abort Interrupt Flag\nWrite 1 to clear this bit to 0.\nNote: This bit filed indicates bus master received ERROR response or not. If bus master received ERROR response, it means that target abort is happened. PDMA controller will stop transfer and respond this event to software then goes to IDLE state. When target abort occurred, software must reset PDMA, and then transfer those data again.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No bus ERROR response received</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus ERROR response received</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKD_IF</name>
              <description>PDMA Block Transfer Done Interrupt Flag\nThis bit indicates that PDMA has finished all transfers.\nWrite 1 to clear this bit to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Done</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
