cmsis-svd/cmsis-svd/data/Nuvoton/NUC029EE_v1.svd
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT1</name>
          <displayName>PDMA_POINT1</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT2</name>
          <displayName>PDMA_POINT2</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT3</name>
          <displayName>PDMA_POINT3</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT4</name>
          <displayName>PDMA_POINT4</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT5</name>
          <displayName>PDMA_POINT5</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT6</name>
          <displayName>PDMA_POINT6</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT7</name>
          <displayName>PDMA_POINT7</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_POINT0">
          <name>PDMA_POINT8</name>
          <displayName>PDMA_POINT8</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <alternateRegister>PDMA_POINT0</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register>
          <name>PDMA_CSAR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CSAR0</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_CSAR</name>
              <description>PDMA Current Source Address Register (Read Only)\nThis field indicates the source address where the PDMA transfer just occurred.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR1</name>
          <displayName>PDMA_CSAR1</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR2</name>
          <displayName>PDMA_CSAR2</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR3</name>
          <displayName>PDMA_CSAR3</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR4</name>
          <displayName>PDMA_CSAR4</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR5</name>
          <displayName>PDMA_CSAR5</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR6</name>
          <displayName>PDMA_CSAR6</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR7</name>
          <displayName>PDMA_CSAR7</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSAR0">
          <name>PDMA_CSAR8</name>
          <displayName>PDMA_CSAR8</displayName>
          <description>PDMA Channel x Current Source Address Register</description>
          <alternateRegister>PDMA_CSAR0</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register>
          <name>PDMA_CDAR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CDAR0</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_CDAR</name>
              <description>PDMA Current Destination Address Register (Read Only)\nThis field indicates the destination address where the PDMA transfer just occurred.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR1</name>
          <displayName>PDMA_CDAR1</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR2</name>
          <displayName>PDMA_CDAR2</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR3</name>
          <displayName>PDMA_CDAR3</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR4</name>
          <displayName>PDMA_CDAR4</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR5</name>
          <displayName>PDMA_CDAR5</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR6</name>
          <displayName>PDMA_CDAR6</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR7</name>
          <displayName>PDMA_CDAR7</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_CDAR0">
          <name>PDMA_CDAR8</name>
          <displayName>PDMA_CDAR8</displayName>
          <description>PDMA Channel x Current Destination Address Register</description>
          <alternateRegister>PDMA_CDAR0</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register>
          <name>PDMA_CBCR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CBCR0</displayName>
          <description>PDMA Channel x Current Transfer Byte Count Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_CBCR</name>
              <description>PDMA Current Byte Count Register (Read Only)\nThis field indicates the current remained byte count of PDMA.\nNote: This field value will be cleared to 0, when software set SW_RST (PDMA_CSRx[1]) to '1'.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
